{
  "created_utc": "20251109T020830Z",
  "patient": {
    "age": "67",
    "sex": "female",
    "complaint": "persistent cough",
    "history": "former smoker",
    "meds": "metformin",
    "labs": "normal CBC",
    "vitals": "stable"
  },
  "retrieved": [
    {
      "pmid": 32445082,
      "score": 0.7584089040756226,
      "title": "Utilisation and Determinants of Epidermal Growth Factor Receptor Mutation Testing in Patients with Non-small Cell Lung Cancer in Routine Clinical Practice: A Global Systematic Review.",
      "abstract": "BACKGROUND: Epidermal growth factor receptor (EGFR) mutation testing is recommended for selecting patients with non-squamous non-small cell lung cancer (NSCLC) for EGFR tyrosine kinase inhibitor drug treatment. OBJECTIVE: The objective of this article was to systematically review available evidence on the utilisation and determinants of EGFR mutation testing of patients with NSCLC in routine clinical practice. PATIENTS AND METHODS: Searches were made of five electronic databases (Web of Science, MEDLINE [Ovid], Science Direct, EMBASE and Scopus), bibliographies of relevant articles, studies that cited included studies and relevant cancer websites. Studies were included if they: (1) reported the rate of uptake of EGFR testing in patients with NSCLC; (2) were conducted in routine clinical practice settings; (3) were published in English prior to July 2017; and (4) had full text available. Studies were appraised using the STROBE and the National Institutes of Health (National Heart, Lung and Blood Institute) checklists. RESULTS: Eighteen eligible studies were identified for this systematic review, published between 2011 and 2017, from the USA (n = 7), Canada (n = 2), Republic of Korea (n = 2), Norway (n = 1), Sweden (n = 1), Germany (n = 1), Spain (n = 1), New Zealand (n = 1), China (n = 1) and multiple countries from the Asia-Pacific region (n = 1). Overall, testing for EGFR mutations was undertaken in 16,146 of 52,257 study patients (31%), although testing rates varied widely between different studies (from 7.8% to 78.3%). Single institution retrospective audits reported higher rates of testing (median 65.7%, range 31.3-78.3%) than population-based retrospective cohort analyses (median 23%, range 11-69%) and multi-institutional cross-sectional practitioner surveys (median 19.8%, range 7.8-31.8%). Nine studies reported increasing rates of testing over the study period but maximum testing rates remained less than 75% in most studies. Factors associated with higher testing uptake rates included: female sex; younger age; former/no smoking; advanced stage of lung cancer; adenocarcinoma histology; better mobility; radiation therapy; available tissue specimen; and private insurance. Among 16,146 tested patients, EGFR mutations were detected in 4328 patients (26.8%). However, estimates of mutation prevalence were biased by incomplete and selective testing in many studies. CONCLUSIONS: The uptake of EGFR mutation testing of patients with NSCLC is suboptimal in many parts of the world. Incomplete uptake of testing is fuelled by selective testing referral practices, sample limitations, and funding constraints."
    },
    {
      "pmid": 34500194,
      "score": 0.7568626999855042,
      "title": "The expanding capability and clinical relevance of molecular diagnostic technology to identify and evaluate EGFR mutations in advanced/metastatic NSCLC.",
      "abstract": "Epidermal growth factor receptor (EGFR) mutation testing in advanced non-small-cell lung cancer (NSCLC) has evolved rapidly over the past decade, largely triggered by the introduction of the targeted EGFR tyrosine kinase inhibitors (TKIs). Initially used to detect common EGFR mutations and determine the most appropriate first-line therapy at diagnosis, testing methodologies have expanded to test for multiple mutations at multiple time points throughout the disease course. Here we review the current mutation testing approaches, including types of biopsies, and the available assays commonly used in the clinic. Specific application of these approaches in advanced NSCLC, including current guideline recommendations, and potential future developments are discussed."
    },
    {
      "pmid": 33704205,
      "score": 0.7568453550338745,
      "title": "Consensus Recommendations for Optimizing Biomarker Testing to Identify and Treat Advanced EGFR-Mutated Non-Small-Cell Lung Cancer.",
      "abstract": "The advent of personalized therapy for non-small-cell lung carcinoma (nsclc) has improved patient outcomes. Selection of appropriate targeted therapy for patients with nsclc now involves testing for multiple biomarkers, including EGFR. EGFR mutation status is required to optimally treat patients with nsclc, and thus timely and accurate biomarker testing is necessary. However, in Canada, there are currently no standardized processes or methods in place to ensure consistent testing implementation. That lack creates challenges in ensuring that all appropriate biomarkers are tested for each patient and that the medical oncologist receives the results for making informed treatment decisions in a timely way.An expert multidisciplinary working group was convened to create consensus recommendations about biomarker testing in advanced NSCLC in Canada, with a primary focus on EGFR testing. Recognizing that there are biomarkers beyond EGFR that require timely identification, the expert multidisciplinary working group considered EGFR testing in the broader context of integration into complex lung biomarker testing. Primarily, the panel of experts recommends that all patients with nonsquamous NSCLC, regardless of stage, should undergo comprehensive reflex biomarker testing at diagnosis with targeted next-generation sequencing. The panel also considered the EGFR testing algorithm and the challenges associated with the pre-analytic, analytic, and post-analytic elements of testing. Strategies for funding testing by reducing silos of single biomarker testing for EGFR and for optimally implementing the recommendations presented here and educating oncology professionals about them are also discussed."
    },
    {
      "pmid": 33380864,
      "score": 0.7568453550338745,
      "title": "Consensus recommendations for optimizing biomarker testing to identify and treat advanced EGFR-mutated non-small-cell lung cancer.",
      "abstract": "The advent of personalized therapy for non-small-cell lung carcinoma (nsclc) has improved patient outcomes. Selection of appropriate targeted therapy for patients with nsclc now involves testing for multiple biomarkers, including EGFR. EGFR mutation status is required to optimally treat patients with nsclc, and thus timely and accurate biomarker testing is necessary. However, in Canada, there are currently no standardized processes or methods in place to ensure consistent testing implementation. That lack creates challenges in ensuring that all appropriate biomarkers are tested for each patient and that the medical oncologist receives the results for making informed treatment decisions in a timely way. An expert multidisciplinary working group was convened to create consensus recommendations about biomarker testing in advanced nsclc in Canada, with a primary focus on EGFR testing. Recognizing that there are biomarkers beyond EGFR that require timely identification, the expert multidisciplinary working group considered EGFR testing in the broader context of integration into complex lung biomarker testing. Primarily, the panel of experts recommends that all patients with nonsquamous nsclc, regardless of stage, should undergo comprehensive reflex biomarker testing at diagnosis with targeted next-generation sequencing. The panel also considered the EGFR testing algorithm and the challenges associated with the pre-analytic, analytic, and post-analytic elements of testing. Strategies for funding testing by reducing silos of single biomarker testing for EGFR and for optimally implementing the recommendations presented here and educating oncology professionals about them are also discussed."
    }
  ]
}